app/views/users/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 3]]
---
             <th><%= book.body %></th>
             <th><p>コメント件数：<%= book.comments.count %></p></th>