app/views/books/index.html.erb

       <div class="error">
       <%= @book.errors.count %>error prohibited this obj from being saved:
---
SELECT COUNT(*) FROM "view_counts" WHERE "view_counts"."book_id" = ?  [["book_id", 1]]

             </th>
             <th><p>コメント数：<%= book.comments.count %></p></th>
             <th><p>閲覧数：<%= See.count %></p></th>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "sees"
SELECT COUNT(*) FROM "view_counts" WHERE "view_counts"."book_id" = ?  [["book_id", 1]]