app/views/books/show.html.erb

            <th class="comment-view">
                <p>コメント件数：<%= @booki.comments.count %></p>
            </th>
            <th><p>閲覧数：<%= See.count %></p></th>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "sees"
SELECT COUNT(*) FROM "view_counts" WHERE "view_counts"."book_id" = ?  [["book_id", 1]]