app/controllers/books_controller.rb

  def index
    @user = current_user
    @book = Book.new
    @books = Book.all

    to = Time.current.at_end_of_day
    from = ( to - 6.day ).at_beginning_of_day
    @books = Book.includes(:favorited_users).
      sort {|a,b|
---
SELECT "books".* FROM "books"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 1]]

  def show

    @see = See.find_by(ip: request.remote_ip)
    if @see
      @booki = Book.find(params[:id])
    else
      @booki = Book.find(params[:id])
      See.create(ip: request.remote_ip)
---
SELECT  "sees".* FROM "sees" WHERE "sees"."ip" = ? LIMIT ?  [["ip", "118.106.138.63"], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sees" ("ip", "created_at", "updated_at") VALUES (?, ?, ?)  [["ip", "118.106.138.63"], ["created_at", "2021-08-03 23:28:16.275705"], ["updated_at", "2021-08-03 23:28:16.275705"]]