app/controllers/books_controller.rb

SELECT  "view_counts".* FROM "view_counts" WHERE "view_counts"."user_id" = ? AND "view_counts"."book_id" = ? LIMIT ?  [["user_id", 2], ["book_id", 1], ["LIMIT", 1]]
INSERT INTO "view_counts" ("created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?)  [["created_at", "2021-08-03 23:53:58.456641"], ["updated_at", "2021-08-03 23:53:58.456641"], ["user_id", 2], ["book_id", 1]]
---
  def show

    @booki = Book.find(params[:id])
    unless ViewCount.find_by(user_id: current_user.id, book_id: @booki.id)
    current_user.view_counts.create(book_id: @booki.id)