app/controllers/messages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "entries"."room_id" FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 1]]
SELECT  "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."room_id" = ? LIMIT ?  [["user_id", 3], ["room_id", 37], ["LIMIT", 1]]
INSERT INTO "entries" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["room_id", 1], ["created_at", "2021-08-03 09:34:46.150480"], ["updated_at", "2021-08-03 09:34:46.150480"]]
INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-08-03 09:34:46.112887"], ["updated_at", "2021-08-03 09:34:46.112887"]]
INSERT INTO "entries" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 37], ["created_at", "2021-08-03 10:19:17.795239"], ["updated_at", "2021-08-03 10:19:17.795239"]]
---
  def show
    @user = User.find(params[:id])
    rooms = current_user.entries.pluck(:room_id)
    entries = Entry.find_by(user_id: @user.id, room_id: rooms)

    unless entries.nil?
      @room = entries.room
    else
      @room = Room.new
      @room.save
      Entry.create(user_id: current_user.id, room_id: @room.id)
      Entry.create(user_id: @user.id, room_id: @room.id)

INSERT INTO "messages" ("user_id", "room_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 19], ["message", "こんにちは"], ["created_at", "2021-08-03 09:51:55.862506"], ["updated_at", "2021-08-03 09:51:55.862506"]]
---
  def create
    @message = current_user.messages.new(message_params)
    @message.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def follow_each_other
    user = User.find(params[:id])